In [1]:
import pandas as pd

In [2]:
#1 Load the CSV file into Pandas and display the first 5 rows of the dataset
df = pd.read_csv("raj11.csv")
df.head(5)

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52,KOLKATA,26-06-2025,17-05-2025,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,17-02-2021,22-07-2025,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62,hyderabad,05-11-2023,08-12-2024,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40,hyderabad,13-03-2022,02-10-2025,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41,CHENNAI,05-04-2024,15-12-2024,NaN,8.0,denise84@example.org,2665569480,India

In [3]:
#2  Display the last 5 rows of the dataset.
df.tail(5)

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,08-12-2020,25-01-2025,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,M,53,bangalore,31-12-2023,07-05-2025,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25,hyderabad,15-02-2022,11-01-2025,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55,NaN,16-03-2021,14-05-2025,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34,HYDERABAD,12-10-2020,27-06-2025,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [4]:
#3 Find the number of rows and columns in the dataset
df.shape

(10200, 12)

In [5]:
#4 Display the column names of the dataset.
df.columns

Index(['Customer_ID', 'Name', 'Gender', 'Age', 'City', 'Signup_Date',
       'Last_Purchase_Date', 'Purchase_Amount', 'Feedback_Score', 'Email',
       'Phone_Number', 'Country'],
      dtype='object')

In [6]:
#5 Use one command to check data types, missing values, and memory usage
df.info

<bound method DataFrame.info of       Customer_ID               Name  Gender         Age         City  \
0        CUST4371        Paul Wilson      m           52     KOLKATA
1        CUST5957       Jason Thomas       M  51.0 years          NaN
2        CUST3754  Brittney Martinez       F          62   hyderabad
3        CUST2934      Brenda Pierce  FEMALE          40   hyderabad
4        CUST5683    Matthew Carroll      f           41     CHENNAI
...           ...                ...     ...         ...          ...
10195   CUST10767       Robert Lewis  female  35.0 years       delhi
10196         NaN        Diane Evans       M          53   bangalore
10197    CUST6315    Joshua Martinez      m           25   hyderabad
10198    CUST4812       Sarah Miller  FEMALE          55          NaN
10199    CUST6588       David Potter  female          34   HYDERABAD

      Signup_Date Last_Purchase_Date  Purchase_Amount  Feedback_Score  \
0      26-06-2025         17-05-2025          26944.0             1.0
1      17-02-2021         22-07-2025          44152.0             2.0
2      05-11-2023         08-12-2024          31745.0             2.0
3      13-03-2022         02-10-2025          39674.0             1.0
4      05-04-2024         15-12-2024              NaN             8.0
...           ...                ...              ...             ...
10195  08-12-2020         25-01-2025          24167.0             9.0
10196  31-12-2023         07-05-2025          11639.0             7.0
10197  15-02-2022         11-01-2025          43832.0             2.0
10198  16-03-2021         14-05-2025          18827.0            10.0
10199  12-10-2020         27-06-2025          35211.0            10.0

                          Email  Phone_Number Country
0      peckvictoria@example.com    2131107701   India
1      owensanthony@example.com    1080761560   india
2            tara39@example.org    8981006345   India
3        berrynancy@example.org    8228064204   india
4          denise84@example.org    2665569480   India
...                         ...           ...     ...
10195    barrycrane@example.net    5004696571   InDia
10196    lisadennis@example.net    5200349941     IND
10197       kelli74@example.org    8147428496   India
10198        dawn84@example.org    2987564247   InDia
10199  kochjonathan@example.org    1926206725   India

[10200 rows x 12 columns]>

In [7]:
#6 Select and display Customer_ID, Name, City, and Purchase_Amount columns
df[["Customer_ID","Name","City","Purchase_Amount"]]

      Customer_ID               Name         City  Purchase_Amount
0        CUST4371        Paul Wilson     KOLKATA           26944.0
1        CUST5957       Jason Thomas          NaN          44152.0
2        CUST3754  Brittney Martinez   hyderabad           31745.0
3        CUST2934      Brenda Pierce   hyderabad           39674.0
4        CUST5683    Matthew Carroll     CHENNAI               NaN
...           ...                ...          ...              ...
10195   CUST10767       Robert Lewis       delhi           24167.0
10196         NaN        Diane Evans   bangalore           11639.0
10197    CUST6315    Joshua Martinez   hyderabad           43832.0
10198    CUST4812       Sarah Miller          NaN          18827.0
10199    CUST6588       David Potter   HYDERABAD           35211.0

[10200 rows x 4 columns]

In [8]:
#7 Display details of customers who belong to the city CHENNAI.
df[df["City"].str.upper() == "CHENNAI"]

Empty DataFrame
Columns: [Customer_ID, Name, Gender, Age, City, Signup_Date, Last_Purchase_Date, Purchase_Amount, Feedback_Score, Email, Phone_Number, Country]
Index: []

In [9]:
#8 Display all customers whose Country is India.
df[df["Country"].str.upper() == "INDIA"]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52,KOLKATA,26-06-2025,17-05-2025,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,17-02-2021,22-07-2025,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62,hyderabad,05-11-2023,08-12-2024,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40,hyderabad,13-03-2022,02-10-2025,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41,CHENNAI,05-04-2024,15-12-2024,NaN,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10194,CUST6146,Cody Thompson,f,40,NaN,21-08-2024,26-10-2024,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,08-12-2020,25-01-2025,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10197,CUST6315,Joshua Martinez,m,25,hyderabad,15-02-2022,11-01-2025,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55,NaN,16-03-2021,14-05-2025,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34,HYDERABAD,12-10-2020,27-06-2025,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [10]:
#9 Display customers whose Purchase_Amount is greater than 30,000
df[df["Purchase_Amount"] > 30000]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
1,CUST5957,Jason Thomas,M,51.0 years,NaN,17-02-2021,22-07-2025,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62,hyderabad,05-11-2023,08-12-2024,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40,hyderabad,13-03-2022,02-10-2025,39674.0,1.0,berrynancy@example.org,8228064204,india
10,CUST3260,Jason Mack,MALE,32,HYDERABAD,14-08-2024,20-01-2025,48115.0,8.0,campbellrobert@example.com,8366856220,India
13,CUST7740,Jose Gross,female,22,Mumbai,14-10-2023,24-04-2025,41323.0,2.0,heather45@example.net,5890325488,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65,delhi,08-12-2020,14-01-2025,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26,kolkata,04-03-2023,30-06-2025,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40,NaN,21-08-2024,26-10-2024,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25,hyderabad,15-02-2022,11-01-2025,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34,HYDERABAD,12-10-2020,27-06-2025,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [11]:
#10 Count how many customers are male and female.
df["Gender"].value_counts()

Gender
f         1184
M         1171
m         1163
F         1157
MALE      1131
female    1128
male      1121
FEMALE    1119
Name: count, dtype: int64

In [12]:
#11 Identify how many missing values are present in each column
df.isnull().sum()

Customer_ID           1023
Name                     0
Gender                1026
Age                    951
City                  1016
Signup_Date              0
Last_Purchase_Date    1012
Purchase_Amount       1021
Feedback_Score        1023
Email                    0
Phone_Number             0
Country                732
dtype: int64

In [13]:
#12 Find customers whose Purchase_Amount is missing
df[df["Purchase_Amount"].isnull()]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
4,CUST5683,Matthew Carroll,f,41,CHENNAI,05-04-2024,15-12-2024,NaN,8.0,denise84@example.org,2665569480,India
6,CUST3651,Laura Vincent,male,18,BANGALORE,16-06-2024,25-04-2025,NaN,3.0,ymiranda@example.net,6917110630,India
8,CUST5189,Sabrina Miller,F,40.0 years,CHENNAI,07-07-2025,30-10-2024,NaN,10.0,shepardcolton@example.net,6233441825,India
11,CUST8028,Mrs. Amy Sharp,F,32,HYDERABAD,03-11-2021,09-07-2025,NaN,8.0,shannon26@example.org,7022900906,IND
19,NaN,Jennifer Santos,MALE,26.0 years,MUMBAI,14-11-2022,08-07-2025,NaN,4.0,figueroaaaron@example.net,2241159195,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10131,CUST4058,Ryan Myers,female,25,CHENNAI,29-05-2021,12-12-2024,NaN,3.0,amberbaker@example.org,1072319959,India
10144,CUST3384,Austin Green,NaN,32,Delhi,11-04-2025,04-02-2025,NaN,2.0,marshalljoshua@example.com,1916136641,India
10152,CUST3085,Sharon Lester,M,57,Chennai,14-03-2024,28-06-2025,NaN,6.0,paulaperez@example.com,1206255280,India
10153,CUST4094,Francisco Gonzalez,FEMALE,28,Bangalore,08-02-2024,12-07-2025,NaN,5.0,iwood@example.net,635244827,IND
10190,CUST7396,Stanley Le,F,38,Hyderabad,11-02-2024,10-10-2024,NaN,1.0,rhondamora@example.com,8321075360,India

In [14]:
#13
df["Purchase_Amount"] = df["Purchase_Amount"].fillna(df["Purchase_Amount"].mean())
df["Purchase_Amount"].isna().sum()

np.int64(0)

In [15]:
#14
df["City"].isnull().sum()

np.int64(1016)

In [16]:
#15
df["Age"].isnull().sum()

np.int64(951)

In [17]:
#16
df["Gender"].value_counts()

Gender
f         1184
M         1171
m         1163
F         1157
MALE      1131
female    1128
male      1121
FEMALE    1119
Name: count, dtype: int64

In [18]:
#17
df["City"].value_counts()

City
Kolkata       820
Mumbai        812
Chennai       784
Bangalore     773
Hyderabad     770
Delhi         763
CHENNAI       404
KOLKATA       395
MUMBAI        393
hyderabad     384
bangalore     383
DELHI         378
delhi         369
BANGALORE     363
HYDERABAD     360
mumbai        352
chennai       343
kolkata       338
Name: count, dtype: int64

In [19]:
#18
df["Country"].value_counts()

Country
India    7132
IND       793
india     772
InDia     771
Name: count, dtype: int64

In [20]:
#19
df["Signup_Date"].head()

0    26-06-2025
1    17-02-2021
2    05-11-2023
3    13-03-2022
4    05-04-2024
Name: Signup_Date, dtype: object

In [21]:
#20
df["Last_Purchase_Date"].head()

0    17-05-2025
1    22-07-2025
2    08-12-2024
3    02-10-2025
4    15-12-2024
Name: Last_Purchase_Date, dtype: object

In [22]:
#21
df["Purchase_Amount"].mean()

np.float64(29090.1287721974)

In [42]:
#22
df.groupby("City")["Purchase_Amount"].mean()

City
BANGALORE     25357.610212
Bangalore     25594.339124
CHENNAI       24124.480646
Chennai       24581.757874
DELHI         25764.930935
Delhi         25128.395785
HYDERABAD     26105.535457
Hyderabad     25599.250707
KOLKATA       24743.261467
Kolkata       36379.521100
MUMBAI        51780.275848
Mumbai        37332.846589
bangalore     52352.753954
chennai       24796.099565
delhi         26019.848298
hyderabad     24924.002997
kolkata       25764.935739
mumbai        24163.413652
Name: Purchase_Amount, dtype: float64

In [24]:
#23
df["City"].value_counts()

City
Kolkata       820
Mumbai        812
Chennai       784
Bangalore     773
Hyderabad     770
Delhi         763
CHENNAI       404
KOLKATA       395
MUMBAI        393
hyderabad     384
bangalore     383
DELHI         378
delhi         369
BANGALORE     363
HYDERABAD     360
mumbai        352
chennai       343
kolkata       338
Name: count, dtype: int64

In [32]:
#24

df[df["Purchase_Amount"] > overall_avg]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
1,CUST5957,Jason Thomas,M,51.0 years,NaN,17-02-2021,22-07-2025,44152.000000,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62,hyderabad,05-11-2023,08-12-2024,31745.000000,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40,hyderabad,13-03-2022,02-10-2025,39674.000000,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41,CHENNAI,05-04-2024,15-12-2024,29090.128772,8.0,denise84@example.org,2665569480,India
6,CUST3651,Laura Vincent,male,18,BANGALORE,16-06-2024,25-04-2025,29090.128772,3.0,ymiranda@example.net,6917110630,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65,delhi,08-12-2020,14-01-2025,45692.000000,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26,kolkata,04-03-2023,30-06-2025,43655.000000,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40,NaN,21-08-2024,26-10-2024,35101.000000,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25,hyderabad,15-02-2022,11-01-2025,43832.000000,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34,HYDERABAD,12-10-2020,27-06-2025,35211.000000,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
#function

In [33]:
def raj(N):
    count=0
    for i in N:
        count=count+1
        return count

In [34]:
raj("rajarya-1")

1

In [35]:
len("rajarya")
help(len)

Help on built-in function len in module builtins:

len(obj, /)
    Return the number of items in a container.

In [38]:
def customer_type(x):
    if x>30000:
        return "high_value"
    else:
        return "regular"

In [39]:
df["new_cudtomer"]=df["Purchase_Amount"].apply(customer_type)

In [40]:
df.head()

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country,new_cudtomer
0,CUST4371,Paul Wilson,m,52,KOLKATA,26-06-2025,17-05-2025,26944.000000,1.0,peckvictoria@example.com,2131107701,India,regular
1,CUST5957,Jason Thomas,M,51.0 years,NaN,17-02-2021,22-07-2025,44152.000000,2.0,owensanthony@example.com,1080761560,india,high_value
2,CUST3754,Brittney Martinez,F,62,hyderabad,05-11-2023,08-12-2024,31745.000000,2.0,tara39@example.org,8981006345,India,high_value
3,CUST2934,Brenda Pierce,FEMALE,40,hyderabad,13-03-2022,02-10-2025,39674.000000,1.0,berrynancy@example.org,8228064204,india,high_value
4,CUST5683,Matthew Carroll,f,41,CHENNAI,05-04-2024,15-12-2024,29090.128772,8.0,denise84@example.org,2665569480,India,regular

In [41]:
#25
df["Customer_Type"] = df["Purchase_Amount"].apply(lambda x: "High Value" if x > overall_avg else "Regular")
df[["Purchase_Amount", "Customer_Type"]]
df.head()

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country,new_cudtomer,Customer_Type
0,CUST4371,Paul Wilson,m,52,KOLKATA,26-06-2025,17-05-2025,26944.000000,1.0,peckvictoria@example.com,2131107701,India,regular,Regular
1,CUST5957,Jason Thomas,M,51.0 years,NaN,17-02-2021,22-07-2025,44152.000000,2.0,owensanthony@example.com,1080761560,india,high_value,High Value
2,CUST3754,Brittney Martinez,F,62,hyderabad,05-11-2023,08-12-2024,31745.000000,2.0,tara39@example.org,8981006345,India,high_value,High Value
3,CUST2934,Brenda Pierce,FEMALE,40,hyderabad,13-03-2022,02-10-2025,39674.000000,1.0,berrynancy@example.org,8228064204,india,high_value,High Value
4,CUST5683,Matthew Carroll,f,41,CHENNAI,05-04-2024,15-12-2024,29090.128772,8.0,denise84@example.org,2665569480,India,regular,High Value